// https://jestjs.io/uk/
/* Практичне питання, що вимагає написання коду:
Напишіть код модульного тесту для функції, яка додає два числа, переконайтеся, що тест перевіряє правильність результату при дійсних вхідних параметрах.*/
// https://jestjs.io/uk/docs/getting-started
// add.test.js - Modular test.

const add = require("./add");

test("додає два числа 3 і 4, щоб отримати 7", () => {
  expect(add(3, 4)).toBe(7);
});

test("додає від’ємні числа -3 і -5, щоб отримати -8", () => {
  expect(add(-3, -5)).toBe(-8);
});

test("додає нуль до будь-якого числа, щоб отримати те ж саме число", () => {
  expect(add(0, 5)).toBe(5);
  expect(add(7, 0)).toBe(7);
});

test("додає дробові числа 0.1 і 0.2, щоб отримати 0.3 з точністю до 5 знаків після коми", () => {
  expect(add(0.1, 0.2)).toBeCloseTo(0.3, 5);
});
